system/blockMeshDict2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;//scale   0.001;

h 26.7;
z 60;
step -16.02;  //H


vertices
(
    (0 0 0)
    (calc "2.5*$h" 0 0)
    (calc "2.5*$h" $step 0)
    (calc "(2.5+35)*$h" $step 0)
    (calc "(2.5+35)*$h" 0 0)
    (calc "(2.5+35)*$h" $h 0)
    (calc "2.5*$h" $h 0)
    (0 $h 0)

    (0 0 $zw)
    (calc "2.5*$h" 0 $zw)
    (calc "2.5*$h" $step $zw)
    (calc "(2.5+35)*$h" $step $zw)
    (calc "(2.5+35)*$h" 0 $zw)
    (calc "(2.5+35)*$h" $h $zw)
    (calc "2.5*$h" $h $zw)
    (0 $h $zw)
);

blocks
(
    hex (0 1 6 7 8 9 14 15) (100 10 1) simpleGrading (1 1 1)
    hex (1 4 5 6 9 12 13 14) (100 10 1) simpleGrading (1 1 1)
    hex (1 2 3 4 9 10 11 12) (100 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    // movingWall
    // {
    //     type wall;
    //     faces
    //     (
    //         (3 7 6 2)
    //     );
    // }
    // fixedWalls
    // {
    //     type wall;
    //     faces
    //     (
    //         (0 4 7 3)
    //         (2 6 5 1)
    //         (1 5 4 0)
    //     );
    // }
    // frontAndBack
    // {
    //     type empty;
    //     faces
    //     (
    //         (0 3 2 1)
    //         (4 5 6 7)
    //     );
    // }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 8 9)
            (10 11 18 19)

            (1 4 7 8)
            (11 14 17 18)

            (4 5 6 7)
            (14 15 16 17)

            (1 2 3 4) //l f
            (11 12 13 14) //l b
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 9 19 10)
        );
    }
    outlet 
    {
        type patch;
        faces 
        (
            (5 6 16 15)
        );
    }
    walls
    {
        type wall;
        faces 
        (

            // (6 7 15 14)
            // (0 8 9 1)        //face 1 in patch 3 does not have neighbour cell face: 4(0 1 9 8)

            // (1 2 10 9)
            // (2 3 11 10)
            // (3 4 12 11)
            // //(4 5 13 12)

            (0 1 11 10)
            (1 2 12 11)
            (2 3 13 12)
            (3 4 14 13)
            (4 5 15 14)

            (9 8 18 19)
            (8 7 17 18)
            (7 6 16 17)
            
            
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //




//My mesh//


/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

h 26.7;
zw 60;
step_size 16.02;
xtra_x -100;

vertices
(
    // (-7.5 -75   0)
    // ( 7.5 -75   0)
    // ( 7.5  75   0)
    // (-7.5  75   0)
    // (-7.5 -75 450)
    // ( 7.5 -75 450)
    // ( 7.5  75 450)
    // (-7.5  75 450)
    
    ($xtra_x 0 $zw)  //0
    (#calc "2.5*$h" 0 $zw) //1
    (#calc "2.5*$h" $step_size $zw) //2
    (#calc "(2.5+35)*$h" $step_size $zw) //3
    ($xtra_x $h $zw)  //4
    (#calc "2.5*$h" $h $zw) //5
    (#calc "(2.5+35)*$h" $h $zw) //6
    (#calc "(2.5+35)*$h" 0 $zw) //7
    
    
    ($xtra_x 0 0)  //0
    (#calc "2.5*$h" 0 0) //1
    (#calc "2.5*$h" $step_size 0) //2
    (#calc "(2.5+35)*$h" $step_size 0) //3
    ($xtra_x $h 0)  //4
    (#calc "2.5*$h" $h 0) //5
    (#calc "(2.5+35)*$h" $h 0) //6
    (#calc "(2.5+35)*$h" 0 0) //7
);

blocks
(
    // hex (0 1 2 3 4 5 6 7) (1 15 45) simpleGrading (1 1 1)
    hex (8 9 13 12 0 1 5 4) (10 10 1) simpleGrading (1 1 1)
    hex (1 2 3 7 9 10 11 15) (10 10 1) simpleGrading (1 1 1)
    hex (9 15 14 13 1 7 6 5) (10 10 1) simpleGrading (1 1 1) 
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
    
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (2 3 11 10)
        );
    }

    step
    {
        type wall;
        faces
        (
            (1 2 10 9)      // err 1 2 8 9
        );
    }

    inlet 
    {
        type patch;
        faces
        (
            (0 8 12 4)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (                               // err ill defined primititive boundary
            (3 11 15 7)
            (7 15 14 6)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 4 5)
            (2 3 7 1)
            (1 7 6 5)
            
            (8 9 13 12)
            (10 11 15 9)                 
            (9 15 14 13)
        );
    }
);

// ************************************************************************* //




//cavity original mesh

// /*--------------------------------*- C++ -*----------------------------------*\
//   =========                 |
//   \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
//    \\    /   O peration     | Website:  https://openfoam.org
//     \\  /    A nd           | Version:  8
//      \\/     M anipulation  |
// \*---------------------------------------------------------------------------*/
// FoamFile
// {
//     version     2.0;
//     format      ascii;
//     class       dictionary;
//     object      blockMeshDict;
// }
// // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// convertToMeters 0.1;

// vertices
// (
//     (0 0 0)
//     (1 0 0)
//     (1 1 0)
//     (0 1 0)
//     (0 0 0.1)
//     (1 0 0.1)
//     (1 1 0.1)
//     (0 1 0.1)
// );

// blocks
// (
//     hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
// );

// edges
// (
// );

// boundary
// (
//     movingWall
//     {
//         type wall;
//         faces
//         (
//             (3 7 6 2)
//         );
//     }
//     fixedWalls
//     {
//         type wall;
//         faces
//         (
//             (0 4 7 3)
//             (2 6 5 1)
//             (1 5 4 0)
//         );
//     }
//     frontAndBack
//     {
//         type empty;
//         faces
//         (
//             (0 3 2 1)
//             (4 5 6 7)
//         );
//     }
// );

// mergePatchPairs
// (
// );

// // ************************************************************************* //
